IDENTIFICATION DIVISION.
PROGRAM-ID. SUMA.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(4).
01 NUM2 PIC 9(4).
01 RESULTADO PIC 9(5).
PROCEDURE DIVISION.
MAIN-PROCEDURE.
	DISPLAY "Introduce el primer número: ".
	ACCEPT NUM1.
	DISPLAY "Introduce el segundo número: ".
	ACCEPT NUM2.
	ADD NUM1 TO NUM2 GIVING RESULTADO.
    DISPLAY RESULTADO
	STOP RUN.
END PROGRAM SUMA.